var value = "4"/*Вы должны ввести число 4*/;
    switch (value) {
    case "1":/*Блок операторов*/
    case "2":/*Блок операторов*/
    case "3": /*Блок операторов*/
    document.write("Hello");/*Будет это выводить при условии если вы ввели эти числа "1","2","3"*/
    break;
    case "4":/*Блок операторов*/
    case "5":/*Блок операторов*/
    document.write("World");/*Будет это выводить при условии если вы ввели эти числа "4","5"*/
    break;
    default:/*Блок операторов*/
    document.write("Error")/*Будет это выводить при условии если вы ввели любое число кроме "1","2","3","4","5"*/
}